app/controllers/wishes_controller.rb

  def index
    @bucket = Wish.all
---
SELECT "wishes".* FROM "wishes"

  def create
    @bucket = Wish.new
    @bucket.wish = params[:wish]
    @bucket.description = params[:description]
    @bucket.save
---
INSERT INTO "wishes" ("description", "wish") VALUES ($1, $2) RETURNING "id"  [["description", "Jump from a plane"], ["wish", "Skydive"]]

  def show
    @bucket = Wish.find(params[:id])
---
SELECT  "wishes".* FROM "wishes"  WHERE "wishes"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @bucket = Wish.find(params[:id])
---
SELECT  "wishes".* FROM "wishes"  WHERE "wishes"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @bucket = Wish.find(params[:id])
    @bucket.wish = params[:wish]
    @bucket.description = params[:description]
    @bucket.save
---
SELECT  "wishes".* FROM "wishes"  WHERE "wishes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "wishes" SET "description" = $1, "wish" = $2 WHERE "wishes"."id" = 1  [["description", "Fly from NY to SF>"], ["wish", "Fly an Airplane>"]]

  def destroy
    Wish.find(params[:id]).delete
---
DELETE FROM "wishes" WHERE "wishes"."id" = 1
SELECT  "wishes".* FROM "wishes"  WHERE "wishes"."id" = $1 LIMIT 1  [["id", 1]]